import React, { useEffect, useState } from 'react';

import StatueUnlock from '../components/StatueUnlock/StatueUnlock';
import Map from '../components/Map';

const markers = [
    [48.622069, 22.298199,'Міні-скульптура «Миколайчик – помічник святого Миколая»'],
    [48.621217, 22.297856,'Міні-скульптура «Маяк Унгвар» (Свободка)'],
    [48.624201, 22.297312,'Міні-скульптура «Ференц Ліст»'],
    [48.621410, 22.297453,'Міні-скульптура «Бравий солдат Швейк»'],
    [48.62579727, 22.30283165,'Міні-скульптура «Гаврило Мартинович Глюк»'],
    [48.622083, 22.298086,'Міні-скульптура «Карпатія»'],
    [48.622293, 22.294021,'Міні-скульптура «Їглавські Їжачки»'],
    [48.621492, 22.297193,'Міні-скульптура «Вузол Кротона»'],
    [48.622475, 22.296944,'Міні-скульптура «Джон Лорд»'],
    [48.625372, 22.296508,'Міні-скульптура «Енді Воргол»'],
    [48.621257, 22.297796,'Міні-скульптура «Кубик Рубіка»'],
    [48.623275, 22.299768,'Міні-скульптура «Вольфганг Амадей Моцарт»'],
    [48.620629, 22.303882,'Міні-скульптура «Микола Шугай»'],
    [48.625091, 22.298392,'Міні-скульптура «Малий Уж» («Дві рибини»)'],
    [48.625937, 22.296445,'Міні-скульптура «Майкл Стренк»'],
    [48.621376, 22.287033,'Міні-скульптура «Гаррі Гудіні»'],
    [48.622905, 22.301648,'Міні-скульптура «Ейфелева вежа»'],
    [48.62056, 22.29967,'Міні-скульптура «Бейла Барток»'],
    [48.623079, 22.299323,'Міні-скульптура Винолюб («Петро Перший»)'],
    [48.624123, 22.298010,'Міні-скульптура «Мухаммад аль-Ідрісі»'],
    [48.642446, 22.310454,'Міні-скульптура «Маннекен піс»'],
    [48.620900, 22.298636,'Міні-скульптура «Крістіна Чакі та Міклош Берчені»'],
    [48.621336, 22.297723,'Міні-скульптура «Тивадар Чонтварі»'],
    [48.62326, 22.29461,'Міні-скульптура «Воїни АТО»'],
    [48.621081, 22.305645,'Міні-скульптура «Князь Лаборець»'],
    [48.62473, 22.29558,'Міні-скульптура «Україна – Єдина»'],
    [48.621586, 22.299435,'Міні-скульптура «Кукоц»'],
    [48.62169, 22.29947,'Міні-скульптура «Ханукія»'],
    [48.623638, 22.295270,'Міні-скульптура «Hallom»'],
    [48.622102, 22.286979,'Міні-скульптура «Лебедине озеро»'],
    [48.609164, 22.298584,'Міні-скульптура «Hasta la vista, Lenin»'],
    [48.62523, 22.29659,'Міні-скульптура «Георгій Жаткович»'],
    [48.62615, 22.29276,'Міні-скульптура «Іштван Лаудон»'],
    [48.62000, 22.29546,'Міні-скульптура «Метеорит Княгиня»'],
    [48.59515, 22.31466,'Міні-скульптура «Наполеон»'],
    [48.61974, 22.29582,'Міні-скульптура «Ференц Еркель»'],
    [48.63496, 22.29083,'Міні-скульптура «Янош Арань»'],
    [48.61499, 22.30117,'Міні-скульптура «Ференц Келчеї»'],
    [48.62015, 22.29938,'Міні-скульптура «Свята корона»'],
    [48.61217, 22.31810,'Міні-скульптура «Іштван Дендеші – перлина Ужгорода»'],
    [48.62236, 22.29902,'Міні-скульптура «Кавовий ростер»'],
    [48.63364, 22.27979,'Міні-скульптура «Закарпатський кіфлик»'],
    [48.62495, 22.30247,'Міні-скульптура «Другет»'],
    [48.62435, 22.29064,'Міні-скульптура «Томаш Масарик»'],
    [48.62749, 22.29040,'Міні-скульптура «Фрідман Мілтон»'],
    [48.62410, 22.29250,'Міні-скульптура «Ласло Боді»'],
    [48.62260, 22.28864,'Міні-скульптура «Баффало Білл»'],
    [48.60633, 22.33708,'Міні-скульптура «Ротонда Св. Анни»'],
    [48.62252, 22.30061,'Міні-скульптура «Торт Ужгород»'],
    [48.62369, 22.28592,'Міні-скульптура «Кртчек»'],
    [48.62180, 22.27845,'Міні-скульптура «Закарпатські чемпіони»'],
    [48.62469, 22.29595,'Міні-скульптура «Наші козаки»'],
    [48.60974, 22.30038,'Міні-скульптура «Валіза 2022 року»'],
    [48.63665, 22.30287,'Міні-скульптура «Професор з окопу»'],
    [48.62208, 22.30425,'Міні-скульптура «Ведмедик Моцко»'],
    [48.63435, 22.30678,'Міні-скульптура «Пораймос»'],
    [48.62157, 22.29792,'Міні-скульптура «Ужанська русалонька»'],
    [48.63549, 22.29088,'Міні-скульптура «Alma mater»'],
    [48.62120, 22.30796,'Міні-скульптура «Легенди (Міфи) Закарпатських замків»'],
    [48.62172, 22.30831,'Міні-скульптура «Castrum Ung»'],
    [48.62016, 22.30464,'Міні-скульптура «Екскурсовод»'],
    [48.622054, 22.295109,'Міні-скульптура «Спортивний орієнтувальник»'],
    [48.62139, 22.29779,'Міні-скульптура «Ласло Біро»'],
    [48.62147, 22.29770,'Міні-скульптура «Нандор Плотені»'],
    [48.5949844,22.3145491, 'Міні-скульптура "Наполеон Бонапарт"'],
    [48.623528, 22.285724, 'Міні-фігурка "Дідусь Вечернічк"'],
];

function Quests() {

    const [statues, setStatues] = useState([]);

    useEffect(() => {
        const fetchStatues = async () => {
            try {
                const res = await fetch('http://localhost:5000/places/statues');
                if (!res.ok) throw new Error('Помилка при отриманні статуй');
                const data = await res.json();
                setStatues(data);
            } catch (err) {
                //setError(err.message || 'Щось пішло не так...');
            }
        };

        fetchStatues().then(r => console.log(statues));
    }, []);

    return (
        <div style={{ padding: '20px', textAlign: 'center' }}>
            <h1>Квест</h1>
            <Map markers={markers} height={500}/>
            <div
                style={{
                    display: 'grid',
                    gridTemplateColumns: 'repeat(4, 1fr)',
                    gap: '20px',
                }}
            >
                {statues.map((statue) => (
                    <StatueUnlock
                        key={statue.id}
                        statueName={statue.name}
                        imageUrl={statue.imageUrl}
                        correctCoordinates={statue.latitude+', '+statue.longitude}
                        latitude={statue.latitude}
                        longitude={statue.longitude}
                    />
                ))}
            </div>
        </div>
    );
}

export default Quests;
